src/InformationRegisters/ФактическиеТрудозатраты/ФактическиеТрудозатраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФактическиеТрудозатраты</name>
  <resources>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьСверхурочно</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДлительностьВВыходные</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ЕжедневныйОтчет</name>
    <type>
      <types>DocumentRef.ЕженедельныйОтчет</types>
      <types>DocumentRef.ЕжедневныйОтчет</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеРаботы</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Удалена</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>CatalogRef.Контроль</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Проекты</types>
      <types>DocumentRef.ЕженедельныйОтчет</types>
      <types>DocumentRef.ВходящееПисьмо</types>
      <types>TaskRef.ЗадачаИсполнителя</types>
      <types>DocumentRef.ИсходящееПисьмо</types>
      <types>CatalogRef.Файлы</types>
      <types>CatalogRef.ВходящиеДокументы</types>
      <types>DocumentRef.Отсутствие</types>
      <types>CatalogRef.ВнутренниеДокументы</types>
      <types>DocumentRef.ЕжедневныйОтчет</types>
      <types>CatalogRef.ИсходящиеДокументы</types>
      <types>CatalogRef.Мероприятия</types>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроектнаяЗадача</name>
    <type>
      <types>CatalogRef.ПроектныеЗадачи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРабот</name>
    <type>
      <types>CatalogRef.ВидыРабот</types>
    </type>
  </dimensions>
  <dimensions>
    <name>УдалитьОписаниеРаботы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>НомерДобавления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Начало</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Окончание</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/CommonModules/УчетВремениВызовСервера/Module.bsl
// Возвращает фактические работы на дату по пользователю
//	
Функция ПолучитьРаботыЗаДень(Дата, Пользователь) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ФактическиеТрудозатраты.Подразделение КАК Подразделение,
	|	ФактическиеТрудозатраты.Пользователь КАК Пользователь,
	|	ФактическиеТрудозатраты.Источник КАК Источник,
	|	ФактическиеТрудозатраты.Проект КАК Проект,
	|	ФактическиеТрудозатраты.ПроектнаяЗадача КАК ПроектнаяЗадача,
	|	ФактическиеТрудозатраты.ВидРабот КАК ВидРабот,
	|	ФактическиеТрудозатраты.ДатаДобавления КАК ДатаДобавления,
	|	ФактическиеТрудозатраты.Начало КАК Начало,
	|	ФактическиеТрудозатраты.Окончание КАК Окончание,
	|	ФактическиеТрудозатраты.Длительность КАК Длительность,
	|	ФактическиеТрудозатраты.ЕжедневныйОтчет КАК ЕжедневныйОтчет,
	|	ФактическиеТрудозатраты.ОписаниеРаботы КАК ОписаниеРаботы,
	|	ФактическиеТрудозатраты.НомерДобавления КАК НомерДобавленияИсходный
	|ИЗ
	|	РегистрСведений.ФактическиеТрудозатраты КАК ФактическиеТрудозатраты
	|ГДЕ
	|	НАЧАЛОПЕРИОДА(ФактическиеТрудозатраты.ДатаДобавления, ДЕНЬ) = НАЧАЛОПЕРИОДА(&ДатаОтчета, ДЕНЬ)
	|	И ФактическиеТрудозатраты.Пользователь = &Пользователь";
	Запрос.УстановитьПараметр("ДатаОтчета", Дата);
	Запрос.УстановитьПараметр("Пользователь", Пользователь);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

// Заполняет время начала и окончания дня в зависимости от настроек пользователя
//
Процедура ЗаполнитьНачалоИОкончаниеДня(Объект) Экспорт
	
	Если Не ПолучитьФункциональнуюОпцию("ИспользоватьГрафикиРаботы") Тогда 
		Возврат;
	КонецЕсли;	
	
	Если Не ЗначениеЗаполнено(Объект.Пользователь) Тогда 
		Возврат;
	КонецЕсли;	
	
	ГрафикРаботы = ГрафикиРаботы.ПолучитьГрафикРаботыПользователя(Объект.Пользователь);
	СтруктураВозврата = ГрафикиРаботы.ПолучитьНачалоИОкончаниеРабочегоДня(Объект.Дата, ГрафикРаботы);
	
	Если ЗначениеЗаполнено(СтруктураВозврата.НачалоДня) Тогда 
		Объект.НачалоДня = СтруктураВозврата.НачалоДня;
		Объект.НачалоДня = Объект.НачалоДня - Секунда(Объект.НачалоДня);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(СтруктураВозврата.ОкончаниеДня) Тогда 
		Объект.ОкончаниеДня = СтруктураВозврата.ОкончаниеДня;
		Объект.ОкончаниеДня = Объект.ОкончаниеДня - Секунда(Объект.ОкончаниеДня);
	КонецЕсли;	
	
КонецПроцедуры
